// 1. Создайте множество, в котором будут храниться экземпляры класса Cat - HashSet<Cat>
// Поместить туда некоторое количество объектов
// 2. Создайте 2 или более котов с одинаковыми параметрами в полях. Поместить их во множество.
// Убедиться, что они все сохранилились во множесте.abstract
// 3. Создайте метод public boolean equals(Object o)
// Пропишите в нём логику сравнения котов по параметрам, хранимим в полях. То есть метод возвращает true, если
// значения во всех полях одинаковые.abstract
// 4. Создать метод public int hashCode()
// который будет возвращать hash, вычисленный на основе класса полей Cat. Можно использовать Object.hash()
// 5. Выведете снова содержимое множества из п.2. Убедиться, что дубликаты удалились.abstract

package Seminar06;
public class Seminar06_05 {
    
}
